public class task1_2 {
    public static void main(String[] args) {
        int a = 42;
        int b = 15;
        int x1 = a & b;
        /*
        0010 1010
        0000 1111
        0000 1010
        */
        System.out.println("Побитовый AND: " + x1);

        int x2 = a | b;
        /*
        0010 1010
        0000 1111
        0010 1111
        */
        System.out.println("Побитовый OR: " + x2);

        int x3 = a ^ b;
        /*
        0010 1010
        0000 1111
        0010 0101
        */
        System.out.println("Побитовый исключающее OR: " + x3);

        int x4 = ~ a;
        /*
        0010 1010
        1111 1111 1111 1111 1111 1111 1111 1111 1111 1111 1111 1111 1111 1111 1101 0101‬
        */
        System.out.println("Побитовый унарный оператор NOT для 42: " + x4);

        int x5 = ~ b;
        /*
        0000 1111
        1111 1111 1111 1111 1111 1111 1111 1111 1111 1111 1111 1111 1111 1111 1111 0000‬
        */
        System.out.println("Побитовый унарный оператор NOT для 15: " + x5);

        int x6 = a >> b;
        /*
        0010 1010
        >> 15
        0000 0000
        ‬*/
        System.out.println("Сдвиг вправо: " + x6);

        int x7 = a << b;
        /*
        0010 1010
        << 15
        0001 0101 0000 0000 0000 0000‬‬
        */
        System.out.println("Сдвиг влево: " + x7);

        int x8 = a >>> b;
        /*
        0010 1010
        >>> 15
        0000 0000
        ‬*/
        System.out.println("Сдвиг вправо с заполнением нулями: " + x8);
    }
}
